#include <iostream>
using namespace std;
int main()
{
    // 1.数据类型 数组名[数组长度]；
    int arr1[3];
    arr1[0] = 1;
    arr1[1] = 2;
    arr1[2] = 3;
    for (int i = 0; i < 3; i++)
    {
        cout << arr1[i] << endl;
    }
    // 2.数组名[数组长度]={值1，值2，值3......}   如果初始化的时候，没有全部填写完，会用0来填补剩余数据
    int arr2[6] = {1, 2, 3};
    for (int i = 0; i < 6; i++)
    {
        cout << arr2[i] << endl;
    }
    // 3.数组名[ ]={值1，值2，值3.....}
    int arr3[] = {1, 2, 3};
    for (int i = 0; i < 3; i++)
    {
        cout << arr3[i] << endl;
    }
    system("pause");
    return 0;
}
/*******************************
数组：一个集合里面存放了相同类型的数据元素
特点1：数组中的每个元素都是相同的数据类型
特点2：数组是由连续的内存位置组成的
一维数组定义的三种方式：1.数据类型 数组名[数组长度]；
                      2.数组名[数组长度]={值1，值2，值3......}
                      3.数组名[ ]={值1，值2，值3.....}
********************************/