#include <iostream>
using namespace std;
int main()
{
    int score = 0;
    cout << "请输入一个分数：";
    cin >> score;
    cout << "您输入的分数为：" << score << endl;
    if (score > 600) // if语句后面不要加; 否则会直接执行后面的语句
    {
        cout << "恭喜你考上了985" << endl;
        if (score > 700)
        {
            cout << "恭喜你上了清北" << endl;
        }
    }
    else if (score > 550)
    {
        cout << "恭喜你考上了211" << endl;
        if (score<575)
        {
            cout << "恭喜考上了河南工业大学" << endl;
        }
    }
    else if (score > 500)
    {
        cout << "恭喜你考上了双非" << endl;
    }
    else
    {
        cout << "你没学上了" << endl;
    }
    system("pause");
    return 0;
}
/********************************
c/c++支持的最基本的程序运行结构：顺序结构、选择结构、循环结构
顺序结构：程序按顺序执行，不发生跳转
选择结构：依据条件是否满足，有选择地执行相应功能
循环结构：依据条件是否满足，循环多次执行某段代码
if语句；1.单行格式if语句： if（条件）{条件满足执行的语句}
        2.多行格式if语句： if（条件）{条件满足执行的语句}else{条件不满足执行的语句};
        3.多条件的if语句： if（条件）{条件满足执行的语句}else if（条件2）{条件2满足执行的语句}.......else{都不满足执行的语句}
        4.嵌套if语句：在if语句中，可以嵌套使用if语句，达到更精准的条件判断

*********************************/